public class HW_6 {

   /* Задача №3

    Необходимо создать класс Employee с полями как у Person (из предыдущего задания) и полем зарплата.
    Класс должен иметь метод isSameName(Employee employee) который возвращает true, если у сотрудника у которого
    был вызван метод и сотрудника который был передан как параметр, одинаковое имя.

     Задача №4
    Необходимо создать класс SalaryUtils с единственным методом -
    getSum(Employee[] employeeArray), метод должен возвращать сумму зарплат всех сотрудников из массива переданного
    в качестве аргумента вызова метода.

    Задача №5
    Необходимо создать утилитарный класс EmployeeUtils со следующими методами:
    поиск сотрудника в массиве по его имени
    поиск сотрудника в массиве по вхождению указанной строки в его имени
    подсчет зарплатного бюджета для всех сотрудников в массиве
    поиск наименьшей зарплаты в массиве
    поиск наибольшей зарплаты в массиве

    Задача от Алисы
    Создать класс в котором будут поля Имя, Возраст, Страна, Зарплата (цифрами просто),
    образование (Bachelor, PhD и тд). Создать во ВТОРОМ классе около 10 человек (минимум 8 ) и
    использовать методы первого класса. Сделать сортировки по всем параметрам(например сначала выводит тех кто из США,
    потом кто из Японии и тд).
    На основе данной задачи, будут еще по мере продвижения по темам. Опционально к выполнению.

    Задача от Алисы

    Создать класс в котором будут поля Имя, Возраст, Страна, Зарплата (цифрами просто),
    образование (Bachelor, PhD и тд). Создать во ВТОРОМ классе около 10 человек (минимум 8 )
    и использовать методы первого класса. Сделать сортировки по всем параметрам(например сначала выводит
    тех кто из США, потом кто из Японии и тд).
    На основе данной задачи, будут еще по мере продвижения по темам. Опционально к выполнению.
*/



}
